/*
***有这样一道智力题：“某商店规定：三个空汽水瓶可以换一瓶汽水。
***小张手上有十个空汽水瓶，她最多可以换多少瓶汽水喝？”答案是
***5瓶，方法如下：先用9个空瓶子换3瓶汽水，喝掉3瓶满的，喝完
***以后4个空瓶子，用3个再换一瓶，喝掉这瓶满的，这时候剩2个空
***瓶子。然后你让老板先借给你一瓶汽水，喝掉这瓶满的，喝完以
***后用3个空瓶子换一瓶满的还给老板。如果小张手上有n个空汽水
***瓶，最多可以换多少瓶汽水喝
*/
#include<stdio.h>

void main()
{
    int n;
    int total;
    
    while(scanf("%d", &n) && n)
    {
        total = 0;

        if(n == 1)
            total = 0;
        else if(n == 2)
            total = 1;
        else
        {
            while(n / 3)
            {
                total = total + n / 3;
                n = n / 3 + n % 3;
            }
            if(n % 3 == 2)
                total = total + 1;
        }

        printf("%d\n", total);
    }
}